Project-Stage 2/friend_photos/app/controllers/photo_controller.rb

  def upload
    @title = "Upload Your Photo"
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)