Project-Stage 2/friend_photos/app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 4)
---
  def index

    @title = "Friend Photos Member's Page"
    # This will be a protected page for viewing user information.

    @user = User.find(session[:user_id])

INSERT INTO `users` (`created_at`, `updated_at`, `password`, `screen_name`, `email`) VALUES('2010-10-16 13:05:32', '2010-10-16 13:05:32', 'adsf', 'dwarfered', 'chris.dymond@iinet.net.au')
---
  def register
    @title = "Register for Friend Photos"

    if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM `users` WHERE (`users`.`screen_name` = 'chris2511' AND `users`.`password` = 'chris2511') LIMIT 1
---
  def login
    @title = "Log in to Friend Photos"
    if param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name,@user.password)